/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   main.c                                             :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: gmorra <gmorra@student.42.fr>              +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2020/12/01 19:36:20 by gmorra            #+#    #+#             */
/*   Updated: 2020/12/13 19:40:48 by gmorra           ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include "includes/libft.h"
#include "includes/libft_printf.h"
char				*ft_itoa(int n);

int				main(void)
{
	printf("ORIGA PRINTF\n");
	printf("-----\n\n");

	#pragma region INT_ORIGINAL_PRINTF
	printf("-d    12345   [%-d]\n", 12345);
	printf(".d    12345   [%.d]\n", 12345);
	printf("10d   12345   [%10d]\n", 12345);
	printf("10d  -12345   [%10d]\n", -12345);
	printf("-10d  12345   [%-10d]\n", 12345);
	printf("-10d -12345   [%-10d]\n", -12345);
	printf("010d  12345   [%010d]\n", 12345);
	printf("010d -12345   [%010d]\n", -12345);
	printf("-.10d 12345   [%-.10d]\n", 12345);
	printf("-.10d  -12345 [%-.10d]\n", -12345);
	printf(".10d  12345   [%.10d]\n", 12345);
	printf(".10d  -12345  [%.10d]\n", -12345);
	printf("0.10d  12345  [%0.10d]\n", 12345);
	printf("0.10d -12345  [%0.10d]\n", -12345);

	printf(" 15d -12345   [%15d]\n", -12345);
	// printf(".10d -12345   [%.10d]\n", -12345);
	printf("9.9d  12345:  [%9.9d]\n", 12345);
	printf("9.10d 12345:  [%9.10d]\n", 12345);
	printf("-9.10d -12345:[%-9.10d]\n", -12345);
	printf("010.10d 12345:[%010.10d]\n", 12345);
	printf("010.10d -12345[%010.10d]\n", -12345);
	printf("10.15d 12345: [%10.15d]\n", 12345);
	printf("15.10d 12345: [%15.10d]\n", 12345);
	printf("-10.5d 12345: [%-10.5d]\n", 12345);
	// printf("15......10d 12345: [%15......10d]\n", 12345);	// warning		flags: ERROR!
	printf("    015.10d 12345: [%015.10d]\n", 12345);
	printf("0000015.10d 12345: [%0000015.10d]\n", 12345);
	printf("    -15.10d 12345: [%-15.10d]\n", 12345);
	printf("-----15.10d 12345: [%-----15.10d]\n", 12345);
	// printf("Int 50 0-35d :[%0-35d]\n", 50);					// warning
	printf("dva [%%]: %%\n");
	printf("%%---0.3 yes\n");
	#pragma endregion INT_ORIGINAL_PRINTF

	printf("\nMEIN FT_PRINTF\n");
	printf("-----\n\n");
	// ft_printf("dva [%%]: %%\n");
	ft_printf("Int -12345       :[%5.5d] ddd\n", 0);
	printf("O_R Int -12345   :[%5.5d] ddd\n", 0);
	ft_printf("Int  12345 :[%-10.5d] 1234567890 \n", -12345);
	printf("Int  12345 :[%-10.5d] 1234567890 \n", -12345);
	printf("\n-----\n");

/*
todo list:
1) Разбить парсер || done
2) Static функции (при разбивке)
3) Обработка звездочки
4) Два процента на ввод

Что сделанно наполовину или почти правильно:
1) Отрицательные значения с 0 и точностью выдают разные результаты (на один ноль где-то больше) || fix
2) Возможно процентов на 146% обработка инта где-то крашнется, это фиксануть (но сначала найти)
3) Если ширина и точность одинаковая то бан		|| вроде фиксанул
4) Если ширина меньше точности то смэрть		|| вроде тоже
5) %010.5d не работает || fix
6) Косячная ширина в парсере || (фикс)
7) Точность 0 при аргументе 0 должно выводить пустоту
*/
}
